# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Ibrahim\Documents\Desktop\sample_v9\sample.cydsn\sample.cyprj
# Date: Mon, 11 Jan 2016 09:09:42 GMT
#set_units -time ns
create_clock -name {AD_konverter_IntClock(routed)} -period 791.66666666666663 -waveform {0 395.833333333333} [list [get_pins {ClockBlock/dclk_2}]]
create_clock -name {Sample_Clock(routed)} -period 50000 -waveform {0 25000} [list [get_pins {ClockBlock/dclk_5}]]
create_clock -name {Regulation_Clock(routed)} -period 10000000 -waveform {0 5000000} [list [get_pins {ClockBlock/dclk_6}]]
create_clock -name {Log_Clock(routed)} -period 200000000 -waveform {0 100000000} [list [get_pins {ClockBlock/dclk_7}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Counter_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {AD_konverter_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 19 39} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 53 105} -nominal_period 2166.6666666666665 [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {Speed_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 241 481} [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {Sample_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 1201 2401} [list [get_pins {ClockBlock/dclk_glb_5}]]
create_generated_clock -name {Log_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 4800001 9600001} [list [get_pins {ClockBlock/dclk_glb_7}]]
create_generated_clock -name {PWM_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 9} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {Regulation_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 240001 480001} [list [get_pins {ClockBlock/dclk_glb_6}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\Ibrahim\Documents\Desktop\sample_v9\sample.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Ibrahim\Documents\Desktop\sample_v9\sample.cydsn\sample.cyprj
# Date: Mon, 11 Jan 2016 09:09:21 GMT
