# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\jonathan\Documents\GitHub\PRJ4\Software\MotorControllerPSoC\MotorController\MotorController.cydsn\MotorController.cyprj
# Date: Mon, 07 Mar 2016 09:17:22 GMT
#set_units -time ns
create_clock -name {PowerMonitor_1_ADC_Ext_CP_Clk(routed)} -period 208.33333333333331 -waveform {0 104.166666666667} [list [get_pins {ClockBlock/dclk_2}]]
create_clock -name {Clock_motor(routed)} -period 5000000 -waveform {0 2500000} [list [get_pins {ClockBlock/dclk_4}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {CyBUS_CLK(fixed-function)} -period 41.666666666666664 -waveform {0 20.8333333333333} [get_pins {ClockBlock/clk_bus_glb_ff}]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {PowerMonitor_1_ADC_Ext_CP_Clk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 11} -nominal_period 208.33333333333331 [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {PowerMonitor_1_ADC_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 19 37} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_clock -name {PowerMonitor_1_ADC_theACLK(fixed-function)} -period 750 -waveform {0 375} [get_pins {ClockBlock/aclk_glb_ff_0}]
create_generated_clock -name {pmon_clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 25 49} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {Clock_motor} -source [get_pins {ClockBlock/clk_sync}] -edges {1 120001 240001} [list [get_pins {ClockBlock/dclk_glb_4}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\jonathan\Documents\GitHub\PRJ4\Software\MotorControllerPSoC\MotorController\MotorController.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\jonathan\Documents\GitHub\PRJ4\Software\MotorControllerPSoC\MotorController\MotorController.cydsn\MotorController.cyprj
# Date: Mon, 07 Mar 2016 09:16:57 GMT
